results/res4/h200_h200_disagg_tp1_32b_image8_1080p_np64_rates_v2/test_sglang_multi_rates_1080p_20260521_222058/rate_1.0/results.txt
/opt/sglang/python/sglang/benchmark/datasets/image.py:51: UserWarning: High resolution (1080x1920) with 512 total images may take a long time. Consider reducing resolution or image count.
  return sample_image_requests(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=64, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=8, image_resolution='1920x1080', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res4/h200_h200_disagg_tp1_32b_image8_1080p_np64_rates_v2/test_sglang_multi_rates_1080p_20260521_222058/rate_1.0/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:7001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=64, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=8, image_resolution='1920x1080', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res4/h200_h200_disagg_tp1_32b_image8_1080p_np64_rates_v2/test_sglang_multi_rates_1080p_20260521_222058/rate_1.0/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 1050508
#Output tokens: 7474
#Total images: 512
#Images per request: 8 (fixed)

Created 64 random jpeg images with average 16723186 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 64/64 [03:05<00:00,  2.90s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    1.0       
Max request concurrency:                 not set   
Successful requests:                     39        
Benchmark duration (s):                  185.41    
Total input tokens:                      640190    
Total input text tokens:                 3086      
Total input vision tokens:               637104    
Total generated tokens:                  4467      
Total generated tokens (retokenized):    4405      
Request throughput (req/s):              0.21      
Input token throughput (tok/s):          3452.89   
Output token throughput (tok/s):         24.09     
Peak output token throughput (tok/s):    775.00    
Peak concurrent requests:                39        
Total token throughput (tok/s):          3476.99   
Concurrency:                             31.40     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   149262.41 
Median E2E Latency (ms):                 150513.56 
P90 E2E Latency (ms):                    176125.36 
P99 E2E Latency (ms):                    180475.50 
---------------Time to First Token----------------
Mean TTFT (ms):                          82780.96  
Median TTFT (ms):                        81425.86  
P99 TTFT (ms):                           122961.61 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          984.98    
Median TPOT (ms):                        472.37    
P99 TPOT (ms):                           4439.87   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           617.59    
Median ITL (ms):                         28.67     
P95 ITL (ms):                            2009.12   
P99 ITL (ms):                            6574.29   
Max ITL (ms):                            124905.60 
==================================================